Revit 2027 API
ModelPath.GetProjectGUID Method
 A GUID identifying Cloud Model project to which the cloud model is associated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid GetProjectGUID()
Public Function GetProjectGUID As Guid
public:
Guid GetProjectGUID()
member GetProjectGUID : unit -> Guid
Return Value
Guid
See Also
Reference
ModelPath Class
Autodesk.Revit.DB Namespace